experiment_results/ftl_hotcold/v1/20260819_025314_KST/runs/T256/fio.txt
2026-08-18T18:27:14+00:00
v1-t256: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=128
...
fio-3.16
Starting 32 processes

v1-t256: (groupid=0, jobs=32): err= 0: pid=1360: Tue Aug 18 18:32:19 2026
  write: IOPS=8604, BW=134MiB/s (141MB/s)(39.5GiB/300885msec); 0 zone resets
    slat (nsec): min=1930, max=582658k, avg=1349158.06, stdev=9594612.90
    clat (usec): min=947, max=2535.2k, avg=473465.19, stdev=165904.99
     lat (usec): min=1485, max=2535.2k, avg=474815.04, stdev=166199.02
    clat percentiles (msec):
     |  1.00th=[  159],  5.00th=[  234], 10.00th=[  279], 20.00th=[  334],
     | 30.00th=[  384], 40.00th=[  430], 50.00th=[  451], 60.00th=[  498],
     | 70.00th=[  550], 80.00th=[  600], 90.00th=[  667], 95.00th=[  735],
     | 99.00th=[  911], 99.50th=[ 1028], 99.90th=[ 1787], 99.95th=[ 2056],
     | 99.99th=[ 2299]
   bw (  KiB/s): min= 6658, max=349983, per=100.00%, avg=138094.09, stdev=1471.39, samples=19118
   iops        : min=  406, max=21865, avg=8626.93, stdev=91.99, samples=19118
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.03%, 50=0.07%
  lat (msec)   : 100=0.27%, 250=4.95%, 500=55.79%, 750=34.20%, 1000=4.11%
  lat (msec)   : 2000=0.51%, >=2000=0.07%
  cpu          : usr=0.44%, sys=1.16%, ctx=996544, majf=0, minf=410
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,2589020,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=134MiB/s (141MB/s), 134MiB/s-134MiB/s (141MB/s-141MB/s), io=39.5GiB (42.4GB), run=300885-300885msec

Disk stats (read/write):
  nvme0n1: ios=51/2588063, merge=0/0, ticks=5/1172088888, in_queue=1166911236, util=99.84%
2026-08-18T18:32:20+00:00
measurement_rc=0