experiment_results/ftl_hotcold/v1/20260819_025314_KST/runs/T256/precondition_fio.txt
2026-08-18T18:25:49+00:00
fill: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process

fill: (groupid=0, jobs=1): err= 0: pid=1117: Tue Aug 18 18:26:06 2026
  write: IOPS=612, BW=613MiB/s (642MB/s)(6144MiB/10031msec); 0 zone resets
    slat (usec): min=36, max=89847, avg=234.54, stdev=1643.81
    clat (msec): min=4, max=615, avg=51.91, stdev=42.73
     lat (msec): min=5, max=615, avg=52.15, stdev=43.00
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   30], 10.00th=[   31], 20.00th=[   33],
     | 30.00th=[   35], 40.00th=[   42], 50.00th=[   45], 60.00th=[   50],
     | 70.00th=[   53], 80.00th=[   59], 90.00th=[   72], 95.00th=[   99],
     | 99.00th=[  171], 99.50th=[  426], 99.90th=[  584], 99.95th=[  600],
     | 99.99th=[  617]
   bw (  KiB/s): min=52306, max=860160, per=99.70%, avg=625347.50, stdev=214997.91, samples=20
   iops        : min=   51, max=  840, avg=610.65, stdev=209.97, samples=20
  lat (msec)   : 10=0.13%, 20=0.15%, 50=63.36%, 100=31.66%, 250=4.02%
  lat (msec)   : 500=0.34%, 750=0.34%
  cpu          : usr=8.54%, sys=11.61%, ctx=5468, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=613MiB/s (642MB/s), 613MiB/s-613MiB/s (642MB/s-642MB/s), io=6144MiB (6442MB), run=10031-10031msec

Disk stats (read/write):
  nvme0n1: ios=50/6460, merge=0/0, ticks=41/321303, in_queue=308552, util=83.36%
2026-08-18T18:26:07+00:00
fill_rc=0